app/Controllers/Auth.php

    public function attemptLogin()
    {
        $session = session();
        $model = new UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $model->where('user_id', $username)->first();
---
SELECT *
FROM `user`
WHERE `user_id` = 'admin'
 LIMIT 1