app/Controllers/Mitra.php

    public function laporanHonor($mitra_id = null)
    {
        $db = \Config\Database::connect('mitra');
        if (!$mitra_id) {
            $data = $db->table('mitra m')
                ->select("m.id AS mitra_id, m.nama_lengkap, hm.bulan_pembayaran,
        SUM((hm.jumlah_satuan * hs.harga_per_satuan) - hm.potongan_pajak) AS total")
                ->join('honor_mitra hm', 'hm.mitra_id = m.id', 'LEFT')
                ->join('honor_satuan hs', 'hs.id = hm.honor_satuan_id', 'LEFT')
                ->groupBy('m.id, hm.bulan_pembayaran')
                ->orderBy('m.nama_lengkap')
                ->get()->getResultArray();
---
SELECT `m`.`id` AS `mitra_id`, `m`.`nama_lengkap`, `hm`.`bulan_pembayaran`, SUM((hm.jumlah_satuan * hs.harga_per_satuan) - hm.potongan_pajak) AS total
FROM `mitra` `m`
LEFT JOIN `honor_mitra` `hm` ON `hm`.`mitra_id` = `m`.`id`
LEFT JOIN `honor_satuan` `hs` ON `hs`.`id` = `hm`.`honor_satuan_id`
GROUP BY `m`.`id`, `hm`.`bulan_pembayaran`
ORDER BY `m`.`nama_lengkap`

    public function daftarMitraKegiatan($kegiatan_id)
    {
        $db = \Config\Database::connect('mitra');
        $sqids = new \Sqids\Sqids();
        $decoded = $sqids->decode($kegiatan_id);
        if (empty($decoded)) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Mitra tidak ditemukan');
        }
        $id = $decoded[0]; // ambil ID asli

        $kegiatan = $db->table('kegiatan_statistik')->where('id', $id)->get()->getRowArray();

        $mitra = $db->table('mitra_kegiatan mk')
            ->select('m.nama_lengkap,jk.jenis_kelamin as jk, m.no_hp, m.email, m.alamat,m.id')
            ->join('mitra m', 'm.id = mk.mitra_id')
            ->join('master_jk jk', 'jk.id = m.jk')
            ->where('mk.kegiatan_id', $id)
            ->get()->getResultArray();
---
SELECT *
FROM `kegiatan_statistik`
WHERE `id` = 8
SELECT `m`.`nama_lengkap`, `jk`.`jenis_kelamin` as `jk`, `m`.`no_hp`, `m`.`email`, `m`.`alamat`, `m`.`id`
FROM `mitra_kegiatan` `mk`
JOIN `mitra` `m` ON `m`.`id` = `mk`.`mitra_id`
JOIN `master_jk` `jk` ON `jk`.`id` = `m`.`jk`
WHERE `mk`.`kegiatan_id` = 8