app/Models/KegiatanModel.php

SELECT `ks`.*, `tk`.`tim_kerja`
FROM `kegiatan_statistik` `ks`
LEFT JOIN `user_auth`.`timkerja` `tk` ON `tk`.`id` = `ks`.`pj`
WHERE `pj` = '817106'
SELECT `ks`.*, `tk`.`tim_kerja`
FROM `kegiatan_statistik` `ks`
LEFT JOIN `user_auth`.`timkerja` `tk` ON `tk`.`id` = `ks`.`pj`
---
    public function getPJ($timkerja = null)
    {
        $dbMaster = \Config\Database::connect('default');
        if ($timkerja) {
            return $this->db->table('kegiatan_statistik ks')
                ->select('ks.*,tk.tim_kerja')
                ->join($dbMaster->database . '.timkerja tk', 'tk.id = ks.pj', 'left')
                ->where('pj', $timkerja)
                ->get()
                ->getResultArray();
        } else {
            return $this->db->table('kegiatan_statistik ks')
                ->select('ks.*,tk.tim_kerja')
                ->join($dbMaster->database . '.timkerja tk', 'tk.id = ks.pj', 'left')
                ->get()
                ->getResultArray();