app/Models/MitraModel.php

SELECT `m`.*, `mk`.`kecamatan` as `nama_kec`, `md`.`desa` as `nama_desa`, `mkab`.`kab` as `nama_kab`, `p`.`posisi`, `mjk`.`jenis_kelamin` as `jk`
FROM `mitra` `m`
LEFT JOIN `master`.`master_kec` `mk` ON `mk`.`id` = CONCAT(81, m.kab, m.kec)
LEFT JOIN `master`.`master_desa` `md` ON `md`.`id` = CONCAT(81, m.kab, m.kec, m.desa)
LEFT JOIN `master`.`master_kab` `mkab` ON `mkab`.`id` = `m`.`kab`
LEFT JOIN `posisi` `p` ON `p`.`id` = `m`.`posisi`
LEFT JOIN `master_jk` `mjk` ON `mjk`.`id` = `m`.`jk`
---
    public function getMitraLengkap($excludeIds = [])
    {
        $dbMaster = \Config\Database::connect('master');
        $builder = $this->db->table('mitra m')
            ->select('m.*, mk.kecamatan as nama_kec, md.desa as nama_desa, mkab.kab as nama_kab, p.posisi, mjk.jenis_kelamin as jk')
            ->join($dbMaster->database . '.master_kec mk', 'mk.id = CONCAT(81, m.kab, m.kec)', 'left')
            ->join($dbMaster->database . '.master_desa md', 'md.id = CONCAT(81, m.kab, m.kec, m.desa)', 'left')
            ->join($dbMaster->database . '.master_kab mkab', 'mkab.id = m.kab', 'left')
            ->join('posisi p', 'p.id = m.posisi', 'left')
            ->join('master_jk mjk', 'mjk.id = m.jk', 'left');

        if (!empty($excludeIds)) {
            $builder->whereNotIn('m.id', $excludeIds);
        }

        return $builder->get()->getResultArray();